[
"Attention arrived scheduled time of 12am saw someone closing up establishment and ask if they are closed and he said yes and told Him I'm the exterminator and I'm scheduled for services he told me have services rescheduled. See attachment labeled 8/4/22 location closing up",
"Service: PEST ELIM MAINT Service. Spray front door , front counter , small station area, kitchen/cookline/dishwasher. Gel front counter &kitvhen crack and crevices, outlets, shelves. Add one glue board . IPM RNR",
"Service: PEST ELIM MAINT Serviced traps and devices in kitchen area bar area.Added  and checked glue boards in kitchen and bar.Added mice snap in bar and kitchen. Void treatment throughout restaurant for mice activityGarbage left out this is a breeding ground for mice activity. Filled out DOH log.",
"Service: PEST ELIM MAINT Arrived at location sprayed and treated all areas checked traps and monitors no pest activity was found signed doh form",
"Service: PEST ELIM MAINT Sprayed kitchen and bathroom also basement and restaurant saw a few drain flies but it’s because they keep leaving mop buckets and rag buckets around signed doh",
"Service: PEST ELIM MAINT General inspection of establishment:Basement:Upon inspecting basement I found heavy fly activity and that’s due because there’s a pile up of garbage in the back basement see attachment. Placed a heavy amount of liberty glue boards throughout the whole basement including meter room. Intensive advion gel crack and cervices throughout basement and bathroom and performed a heavy fan spray of the basement. Heavy spray of Nuvan throughout the whole basement and bathroom to treat for flies. Main level and 2nd floor:Upon inspecting main level and 2nd floor I found no activity. Placed a heavy amount of liberty glue boards throughout the kitchen area and back storage. Intensive Advion gel crack and cervices throughout kitchen area, begin counter and back storage. Heavy fan sprayed whole main level and 2nd floor including kitchen, storage and customer area. Signed DOH",
"Gps on pest pac took me 4 blocks away  my 1 first time there did not know how to get inside Got lucky porter came out to throw garbage away  went back got  in Checked perimeter outside  no bait stations Found Reset all kecthall boxs Changed flyboards  2Needs more fly machines 3 sprayed for flys Drain treatment Outside bar locked Waterbugs  outside",
"Service: PEST ELIM MAINT Treated basement and main door heavy for drains flies and fruit flies",
"Key is not working for black door",
"Service: PEST ELIM MAINT Serviced and spot treated account in dining area, behind front counter, bathrooms, electrical room/office, kitchen, under kitchen equipment, drains, and door frames. No activity to note will maintain control. Signed DOH and took a picture.",
"Service: PEST ELIM MAINT Arrived at location sprayed and treated all areas checked traps and monitors rodent activity in basement gel counters",
"Key Account,does not have keys for the location service was not done,checked all of the keys, not on my batch",
"Service: PEST ELIM MAINT Serviced traps and devices in kitchen area and front station area.Checked all catchalls had 2 mice in them got ride of them. Sprayed all necessary areas.Filled out DOH log.",
"Service: PEST ELIM MAINT Checked all traps and monitors. Minor cockroach activity found at dishwasher area. Used Advion cockroach all around appliances in cracks and crevices. Treated all common areas and hot zones on both basement and main floor with transport and Nyguard.",
"Service: PEST ELIM MAINT General service Perimeter spray All common areas Kitchen Prep areaBathroom Behind counter Deli (store)Basement All storage areas DOH",
"Service: PEST ELIM MAINT Flies behind counter and inside kitchen. Spot sprayed and fan sprayed underneath sinks and inside drains. Serviced coffee station and kitchen, bathrooms and basement. Changed glue in fly lights at coffee station, fly activity on the glue. Inspect all ketchalls, no activity.Updated doh log",
"Service: PEST ELIM MAINT Service. Spray entire establishment perimeter. Signed doh . IPM RNR",
"Service: PEST ELIM MAINT Sprayed kitchen and bathroom also restaurant and basement checked tin kats and found a mice got rid of it and replaced glue boards checked ketch alls found no activity signed doh",
"Service: PEST ELIM MAINT 1 housefly observed in dining areaTreated areas with residual spray Crack and crevice treatment using B&G sprayer and gel bait Spot treatment Dusted areas for rodents Inspected areas for pest activity Updated DOH log",
"Service: PEST ELIM MAINT Arrived at location sprayed and treated all areas checked traps and monitors 1 rodent found inside ketchall gel appliances signed doh collected 65.43 cod",
"Service: PEST ELIM MAINT Checked & updated tincat (no activity found inside). Checked & replaced glue boards. Apply gel for roaches in cracks.Sprayed dining areas, bathroom, behind   Register counter underneath, on the new kitchen sink, underneath salad counter, basement stairs, underneath basement kitchen sink,boiler room,",
"Unable to get lock box open tried code 1035 multiple times does not open",
"Service: PEST ELIM MAINT Treated the kitchen for fly activity. Sprayed all walls down. Still seeing tons of house flies and wet floors. All trash is open containing  food particles. Sprayed around all appliances throughout the kitchen and common areas. Installed and dated all glue boards. Signed doh log.",
"Service: PEST ELIM MAINT IPm checked all areas fan sprayed entire establishment replaced monitors",
"Service: PEST ELIM MAINT Serviced traps and devices in kitchen area front stations area and back room Checked glue boards in kitchen and front station areaVoid treatment throughout restaurant for mice Sprayed all necessary areas.Checked all catch all’s had 3 mice in them got ride of them. Update Doh log",
"Service: RATS Checked all traps and equipment. Replaced all glue boards. Reset all snap 7 traps. Heavy rat activity in kitchen and storage closet. 2 entry points found videos taken one entry point in storage closet used copper mesh to block hole. Second entry point broken panel behind stove. notified one of the employees that it was the entry point an it need to be fixed to prevent rodents from entering the kitchen. Placed several snap traps and glue traps in kitchen for prevention until panel is fixed. No activity found on main floor. Treated all common areas and hot zones with transport and Nyguard.",
"Call Edgar to gain access to the location,no answer went to voicemail,could not leave a message voicemail was full,left a door tag",
"Service: PEST ELIM MAINT Rat activity in front of establishment. Dusted and placed first strike underneath outside dining area. Fly activity at bar, in dining room, kitchen and basement. Treated all drains. Spot and fan sprayed entire establishment. Food debris inside dishwasher drain. Inspect all ketchalls, no activity. Treated basement for fly and cockroaches Updated doh log",
"Service: PEST ELIM MAINT Serviced traps and devices in basement area kitchen area, Front station areaChecked monitors and glue boards throughout kitchen and basementCrack and crevice treatment throughout restaurant and basement for roach activity.Sprayed all necessary areas.Filled out DOH log.",
"Service: PEST ELIM MAINT One dead mouse in ketchall in kitchen. Checked & updated ketchall. Checked & replaced glue boards. Checked & updated LP stations.Sprayed dining areas, hallway, bathroom, behind register counter underneath, underneath little oven, kitchen area underneath kitchen sink, boiler room, office, employees office, basement, storage area, boiler room,,signed doh.",
"Service: PEST ELIM MAINT Sprayed the kitchen, dining room, storage rooms, bathrooms and common areas. Replaced and dated all glue boards. No pest were present.",
"Service: PEST ELIM MAINT Service. Noticing a lot of blackflies and houseflies in the kitchen area knock down a couple flies and added one Prozap underneath dishwasher as they’re mostly in that area no drain flies though . Spray establishment. If problem persist I recommend adding fly light . IPM RNR",
"Service: PEST ELIM MAINT IPm checked all equipment fan sprayed entire establishment replaced monitors",
"Service: NEW ACCT SVCE Serviced and inspected account for roaches and found some areas of the restaurant that needed attention. I applied a whole tube of gel to cracks and crevices in coffee bar area, storage area where mechanical boxes are located, kitchen, and drop ceiling going upstairs. I also installed glue boards to monitor frequent areas where I seen activity. Spot treated account with transport also in dining area, pizza bar, pizza oven, kitchen, under kitchen equipment, coffee station, food storage area, stairwell, and upstairs office was treated as well. Installed DOH signed and took a picture.",
"Fog job recommendation,lots of roaches in basement kitchen area",
"Service: PEST ELIM MAINT Always start with the dining room and the bus boy moves all the seats halfway open so as soon as he moved them he noticed two mice on the glue boards in which I had put that time when they were going to do a service emergency and they never did it and I went on my regular day and did the service on Wednesday regular day but the manager wanted me to switch it to Thursday so I ended up coming that Thursday so he could explain and show all the details so it had put snaps with Peter butter Rtus’ With first strike and plenty of glue boards all the seating have a wooded frame in which the seeds go on top and all of them have a gap after about 3 inches there’s a gap that goes inside the box hole so when The mice sneak in they have Nowhere else to hide besides the seating area there’s a closet area as soon as you walk in which is also set up with monitors and bait  stations today’s isolated incident has to have a entry point because last they were heading the same way that closet is in back of a dining booth in the closet is right by the entrance and the entrance has two doors and steps to lead into the diner that’s a longshot possibility because this is a 24 Hour Pl. there’s always people walking through one door corridor waiting area with two entrances and there’s a closet door on your left which is the  dining side where this activity is happening there Were two  mice ?? oh the same glue board because as soon as the red and the hopped over the same area where the glue board “glue board caught them I Had also dusted the ceiling booth area on  Darwins (Manager’s) approval that last time Reset sniff and put a whole bunch of glue boards in that whole side of booth’s seating areas . Anyways fan  sprayed all areas of diner Including all Areas of the basement baking room food preparation room boiler room storage room Another job which I had to spend two hours completing didn’t Miss any areas updated DOH log into Customer side service ticket no iui",
"Service: PEST ELIM MAINT Sprayed kitchen and bathroom also basement checked mice snaps and tin kats also ketch alls found no activity replaced glue boards and fly boards signed doh",
"Service: PEST ELIM MAINT Serviced traps and devices in kitchen area,bar areas Checked monitors and glue boards throughout kitchen and bar.checked all catch all’s and tin cats had 2 mice in it got ride of it Void treatment.Sprayed all necessary areas.Filled out DOH log.",
"Service: PEST ELIM MAINT Inspected all traps for rodent activity. One of the repairs on the wall were compromised. possibly the reason why there was a mouse in the ketchall. Repaired the hole with several glue boards. Spotted fly activity throughout the kitchen. flies are all swarming all trash and open produce. I strongly recommend we seal away any food and all garbage at night to help minimize the fly activity. Sprayed maxforce fly bait on all walls throughout the restaurant. Installed and dated a prozap below the kitchen sink to kill off any fly activity. Signed doh log.",
"Serviced all garbage containers cafeteria       6 floor Sprayed  cafeteria Drain maintenance all bars Grand teir fly service Floors dry no activity",
"I don't not have the keys for this account",
"Service: PEST ELIM MAINT Sprayed kitchen and bathroom also restaurant and bar area checked tin kats found no activity signed doh",
"Service: PEST ELIM MAINT Checked all traps and monitors. Replaced all glue boards. Minor cockroach activity found on main level an in basement. Treated with advion Cockroach Gel and Delta dust. Treated all common areas and hot zone with transport and Nyguard.",
"Service: PEST ELIM MAINT Service traps and devices in kitchen and bar area.Checked monitors and glue boards.Checked tin cats everything was fine Sprayed all necessary areasfilled out Doh log.",
"Service: PEST ELIM MAINT Service. Spray front door, halls  of bathroom, Front counter, kitchen/dishwasher/cook line. Hotspot all floor and sink drains any establishment. Added for glue boards. IPM RNR",
"Closed upon arrival unable to access location",
"Key not in my possession",
"Key not in my possession",
"I been playing all Pune with this lock for a while it does not open this lock they most have changed it.",
"Service: PEST ELIM MAINT Inspect and serviced bar, dining areas, bathrooms, kitchen, basement and upper floor. Fly activity at bar and in basement,. Spot and fan sprayed basement. Changed glue in fly lights. Treated drains. Inspect all ketchalls, no activity.Updated doh log",
"Service: PEST ELIM MAINT Treated the kitchen, bathrooms, doorways and common areas with transport and nyguard. Checked and reset all ketchalls and installed all new glue boards. Spotted any activity around the coffee bar counter. Ants are making there way in from thee window and marching along the wall of the coffee bar. Focus sprayed the area and treated the counter and window with advion ant gel. Signed doh log.",
"Service: PEST ELIM MAINT Sprayed full perimeter of establishment. Addded for glue boards. Hotspot all floor and sink drains. Signed doh. IPM RNR",
"6234 is alarm code  it wrong on pest pac  must change  alarm went off owner call store  tell me",
"Service: PEST ELIM MAINT Checked all traps and monitors. Location has fly activity in kitchen. Treated area with ecopco. Dead mouse Found in katchall by exit door in kitchen. Door is not secure possible entry point. Treated all common areas in hot zone with transport and Nygaurd. Treated cracks and crevices with advion Cockroach Gel bait.",
"Service: PEST ELIM MAINT IPm checked all equipment found dead mice I. Key all in the kitchen area fan sprayed entire establishment",
"I had started this location and the time did not check in.",
"Service: PEST ELIM MAINT Sprayed kitchen and bathroom also bar and restaurant could not get in the basement the key is for a big lock but it’s a master lock checked rtus found no activity signed doh",
"Dusted  crack crevice",
"Service: PEST ELIM MAINT IPm checked all equipment fan sprayed entire establishment replaced monitors found heavy activity of German roaches.",
"Service: PEST ELIM MAINT Door was wide open opon arrival. Also noticed the window wide open with no screen attached. Rodents can literally walk right through the back door or the window. I strongly advice we don't keep the place like this going forward. There's food and grease build up all below the appliances. All rodents have keen noses and can smell it all seeping out of the door and window. the place has a history of seeing rodents in the establishment and the business is located right next to train tracks. Rats are notorious for lurking around tracks. if we don't want to see unwanted pest, we have to do our best at minimizing all ways for them to gain access. Especially the simple ways of access like the back door or window. Sprayed all rooms doorways and common areas with transport and nyguard. Didn't spot much roach activity in the kitchen or basement. But the bathroom downstairs was definitely seeing roach activity. Sprayed all voids and inside the sink cabinet. Replaced all glue boards. signed doh log.",
"Service: PEST ELIM MAINT Fruit flies are throughout the kitchen I have no more prozaps on me I cannot aerosol spray because of fruits maybe someone who’s in this area can stop by put up a prozap I got none at all . Spray entire perimeter of establishment and add glue board . Hotspot floor and sink drains . IPM RNR",
"Service: PEST ELIM MAINT Sprayed kitchen and bathroom also basement saw a mice run from underneath fryer as I was spraying he went to basement and disappeared found some American roaches in tin kat otherwise no other activity signed doh",
"Service: PEST ELIM MAINT IPm checked all areas no activity found fan sprayed entire establishment replaced monitors",
"Service: PEST ELIM MAINT Checked all traps and equipment. Replaced all glue boards. Use advion cockroach gel bait and cracks and crevices. Treated all common areas with transport and Nyguard.",
"Service: PEST ELIM MAINT Spray entire perimeter of the establishment. Add 4 glue boards . Signed doh. IPM RNR",
"Service: PEST ELIM MAINT This was a two-part service which was gone in one day due to vacation and roach problem which couldn’t be without one good spray down doubling down on the spray which was heavy And double the work which was explained to Michael beforehand Also brought it to Ian’s attentionStarted this job at 4 pm and serviced location for 2 hours straight due to closure for vacation 10 days they will be back next Monday so I serviced location for next week as well used 2 full B & G tanks and found infestation in the kitchen area in the two broken ovens whole bunch of German roaches still there from last week spray underneath as well also by the dishwasher another one by the oil box as well spread really heavy also use delta dust and applied roach gel throughout the kitchen everywhere small activity With fruit flies sprayed the walls as well do the full perimeter spray down fan sprayed kitchen as well as the basement full perimeter good Niban for American roaches and sprayed heavy as well had some houseflies by the garbage can area in the steps that go up to the sidewalk he was psychic for that area so next week I will put the same notes for the completion of that service as well place was closed at 3:45 owner waited for me and I was there by myself for two hours close the door on my way out Luckily I did the service for today when nobody was there because usually kitchen area is flooded with the hose when I come there because they would’ve came back in 10 days with the whole place full of an infestation of German roaches fruit flies and houseflies so once again save the day thank you for using Liberty have a great vacation because we liberated location from serious infestation.",
"Service: PEST ELIM MAINT Sprayed basement and bathroom also restaurant checked ketch alls found no activity could not find doh had to give them a new one signed doh",
"Service: PEST ELIM MAINT Inspected all areas checked all monitors sprayed the perimeter in the basement boiler room and all throughout the restaurant which includes dining room behind the counter kitchen area in the back room preparation room and the dishwashing room in both bathrooms play Joe in the kitchen area checked all glue boards no activity at this time updated DOH log thank you for using Liberty ??",
"Fan sprayed whole place crack and creviceSet gluboards monitors Roaches look better",
"Service: PEST ELIM MAINT Service. Soray full establishment. Add 4 glue boards . Signed doh . IPM RNR",
"My car broke down had to call. Tow  truck  must reschedule",
"Service: PEST ELIM MAINT Serviced and inspected all areas sprayed all necessary areas gel cracks and crevices checked and reset ketchalls no activity in ketchalls replinished monitoring boards updated doh log",
"Service: PEST ELIM MAINT Mice activity in electric room. Evidence found (boxes chewed up) droppings on shelves. Placed snap traps and glue boards. Foam sprayed drains Updated doh log",
"Arrived at location sprayed and treated all areas checked traps and monitors no pest activity was found signed doh form",
"Service: PEST ELIM MAINT Sprayed basement and restaurant also bar could not do kitchen cause the overnight cleaners was in there and everywhere was wet sprayed bathroom’s and I gave them a new doh but with the cleaning being done they are quite clean signed doh",
"Service: PEST ELIM MAINT Arrived at location sprayed and treated all areas checked traps and monitors no pest activity was found no cod collected",
"Service: EVALUATION Inspected all common areas, fly activity reported. Mice droppings located throughout basement as well. Used heppa machine to vacuum droppings. Also performed fly treatment using acu in basement and main dining area. Checked all rodent control as well, no activity reported in rodent control. Performed hot spot treatment on all drains. Location should Constantly be treated. Mass trapping also recommended. Booths should continue to be dusted as well. Recommend fly treatments upon every appointment. Constant hotspot draining as well. Structurally, establishment is a mess. Also water throughout basement floors. Flys breeding in basement is definitely a strong possibility.",
"Service: PEST ELIM MAINT Serviced and inspected all areas sprayed all necessary areas gel cracks and crevices checked and reset ketchalls no activity in ketchalls replinished monitoring boards treated below kitchen appliances sinks and drains",
"Service: PEST ELIM MAINT Serviced all areas of dining room bathroom behind the counter area where the food is and also behind the register counter where the coffee machine in the sink and everything is sprayed all areas in the kitchen as well and also the back preparation area serviced all areas and applied gel to Kitchen area updated Doh log",
"Service: BLITZ Heavy fly activity by lockers. Treated entire basement and bar for flies. Placed EndZone strips and spot and fan sprayed. Changed glue in fly lights Updated doh log",
"Service: PEST ELIM MAINT Treated common areas",
"Service: PEST ELIM MAINT Checked all monitors and traps. Changed glue boards. Sprayed behind counters, under appliances, throughout the dining area, bathroom, storage room, and basement.",
"Service: PEST ELIM MAINT Sprayed kitchen and bathroom also restaurant and rooftop storage also bar area checked lps and found no activity signed doh",
"Service: PEST ELIM MAINT Treated all common areas throughout dining kitchen and basement checked monitor replaced glue boards sprayed throughout perimeter",
"Service: NEW ACCT SVCE Install six ketchalls two and main floor foreign basement.• Installed roach monitors throughout main floor and basement•installed (1) fly light top floor mezzanine • installed doh log in basement by garbage room door.•installed glue boards for monitoring in the basement.Light fly activity, air door curtain recommended for front door.Main floor back by sink mop storage area should be clean,  dry and free of debris.",
"Service: PEST ELIM MAINT Inspected and treated the kitchen, dining room, bathroom,office,storage room,exterior and common areas. Sprayed BandG transport and nyguard plus gel bait in cracks and crevices. Changed bait and glue boards. Checked all bait stations. Treated cracks and crevices with CY kick. The front of the restaurant had no roaches and I found only a few dead roaches on the glue boards in the back storage room. No droppings found. Signed the doh form.,",
"Service: PEST ELIM MAINT Treated all common areas throughout warehouse and offices and bathrooms and basement checked monitor replaced glue boards",
"Service: PEST ELIM MAINT Checked all monitors and traps. Changed glue boards. Sprayed behind counters, under appliances, throughout the kitchen, bathrooms, and basement.",
"Service: EVALUATION Gap under side door (blue).  Gap around glass door.  Organic material and water collecting in grout on second floor in bar area. Mouse droppings found on shelf behind booth on second floor. Mouse droppings found in small prep area behind wine storage across from pizza area.  Hole in wall at seam between two kitchen areas on second floorMouse droppings found under pizza oven.  Hole in wall to left of pizza prep table on second floor.  Mouse droppings found on brick outside pizza area on second floor.  Flies found flying on second floor. Gap under baseboard of 3rd floor counter (partition wall) mouse droppings found in same area.  Mouse droppings found by emergency exit door on 3rd floor. Gapzs in base of wood wall next to emergency door.  Hole in left wall in mechanical room with water heater on 3rd floor.  Water and organic material collecting on floor in 3rd floor kitchen area.  German roaches found in basement electrical panels in corridor. Debris collecting outside door in rear of basement.  Gap under elevated floor in basement storage area that has refrigerators.  Some holes were sealed and treated. Recommend treatment of voids throughout exterior wall and holes mentioned. All droppings need to be cleaned.",
"Service: PEST ELIM MAINT Inspected and treated the kitchen storage room under the sinks flush all drains with hot spot sprayed the dining room and all common areas check all kethalls all traps were clean treated for ants near the front entrance set traps and monitors sign doh form",
"Service: FLY SERVICE Exterminator Pest control serviceIpmFly treatmentTreated terrace for lantern fliesTreated under benches, lawn, c&c, edgesTreated all entire area on terraceAlot of lantern fliesTreated with merit",
"Steak house needs to be rescheduled,closed.",
"Service: PEST ELIM MAINT What I saw was heavy American cockroach activity throughout the school. What I did was fan sprayed baseboards all throughout the site, applied gel to countertops and replaced liberty group boards as needed.",
"Service: PEST ELIM MAINT Treated entire building starting from the 4 floor all the way to first sprayed all offices and bathrooms checked monitor replaced glue boards",
"Service: PEST ELIM MAINT Serviced and inspected all areas sprayed all necessary areas gel cracks and crevices serviced tinkats no activity in tinkats replinished monitoring boards treated below kitchen appliances sinks and drains treated basement floor drains below and around main floor appliances updated doh log",
"Service: PEST ELIM MAINT General roach and rodent service sprayed perimeter drains bathrooms kitchen under. Over and around all ovens and machines no activity at all",
"Met w Roy & quoted 395.00 set up & 90.00 2x a month for rat service in basement area only.",
"The time window is wrong they close at 9 PM",
"Met w Roy & quoted 395.00 set up & 90.00 2x a month for rat service for basement area only.",
"No one knew who Dante was or what I was talking about regarding doing an evaluation for pest control. Gave lead back to Dante to follow up on."
]